import { Product } from './types';

export const PRODUCTS: Product[] = [
  {
    id: 'monthly-plus',
    name: 'চ্যাটজিপিটি প্লাস',
    description: 'স্বল্পমেয়াদী প্রজেক্ট এবং ব্যক্তিগত ব্যবহারের জন্য সেরা।',
    price: 1500, // Adjusted for local context BDT
    duration: '১ মাস',
    image: '⚡',
    features: [
      'সম্পূর্ণ ব্যক্তিগত অ্যাকাউন্ট (Personal)',
      'GPT-4 এর পূর্ণ এক্সেস',
      'দ্রুত রেসপন্স টাইম',
      'নতুন ফিচারে অগ্রাধিকার',
      'ইমেইলে ইনস্ট্যান্ট ডেলিভারি'
    ]
  },
  {
    id: 'yearly-go',
    name: 'ChatGPT GO',
    description: 'দীর্ঘমেয়াদী ব্যবহারের জন্য সাশ্রয়ী সেরা প্যাকেজ।',
    price: 12000, // Adjusted for local context BDT
    duration: '১ বছর',
    image: '🚀',
    popular: true,
    features: [
      '১০০% ব্যক্তিগত অ্যাকাউন্ট (Personal)',
      'বার্ষিক ৩০০০ টাকা সাশ্রয়',
      '✅ আর অনেক বেশী File Upload',
'✅ Fast Images Generation',
'✅ Unlimited Prompt',
'✅ Full Access GPT-5.1',
'✅ Voice Mode ',
'✅ 12 Month Official Subscription',

    ]
  }
];